//Using 이란?


//가장 기본적인 문법들은 프로그래머로써 숨을 쉬는 것과 같다.
//즉 모르면 죽는다는 뜻

//unity에서 지원하는 c#버전이 다를 수 있다.
//C#이 만약 6.0까지 나왔고 unity에서 지원하는 c#버전이 4.0이라고 하면
//인터넷에서 배운 c#이 unity에 적용될 수 없을 수 있다.

//문법도 프로그램의 일부분이고
//미리 쳐져있는 남이 쳐놓은 코드
//프로그램의 화면에 나오는 모든 것을 처리하기 위한 문장들
//ex)주인공이 공격을 가했다.
//등은 이미 다른 사람들이 써놨을 것이고 이걸 가져다 쓸 수 있다.
//즉 모든 코드를 직접 쓸 필요가 없다는 것이다. 

//그 기능을 만든 사람들은 이름을 붙인다.

/* System
 * {<기능 묶음의 시작
 * 주인공이 움직이는 코드
 * 주인공이 말하는 코드
 * 주인공이 달리는 코드
 * }<
 * 
 * 즉 System 을 using한다는 것은 내부에 있는 코드를 사용하겠다는 것이다.
 * 마치 c언어의 include처럼
 */

using System;